|Variable|Definition|Key|
|---|---|---|
|survival|Survival|0 = No, 1 = Yes|
|pclass|Ticket class|1 = 1st, 2 = 2nd, 3 = 3rd|
|gender|gender ||
|Age |Age in years| |
|sibsp |number of siblings / spouses aboard|	|
|parch |number of parents / children aboard| |
|ticket|Ticket number ||
|fare | fare| 	|
|cabin |Cabin number|	|
|embarked|Port of Embarkation|C = Cherbourg, Q = Queenstown, S = Southampton|
|boat | Lifeboat||
|body | Body Identification Number||
|home.dest| Home/destination||

- Read data and describe it
- Find columns with missingdata
- Print shape of dataset
- drop columns with more than 25% missing data
- drop columns having independent values(which do not affect the survival rate).


- check data types of all columns
- convert price to numeric
- find columns still having missing/na values and also count of missing data
- fill na with mean for fare and age column column.
- drop na values for embarked column.
- dump the dataframe to a csv file 'titanic_filtered.csv'.


- for surviced column replace 0 with D and 1 with A
- find the frequency of different values in survived column
- group by gender and survived and see the counts in each category
- find different pclass and no of people in each class

- find top 5 people with highest values of age. Count no of male and females in the top 5
- find max age male and female who survived
- get average age by gender
- get average age by people survived vs not-survived

In [320]:
import numpy as np
import pandas as pd

In [321]:
# Read data and describe it
titanic_df = pd.read_csv('titanic_dataset.csv')
titanic_df.describe()

,Unnamed: 0,pclass,survived,age,sibsp,parch,body
count,1309.000000,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,121.000000
mean,654.000000,2.294882,0.381971,29.881135,0.498854,0.385027,160.809917
std,378.020061,0.837836,0.486055,14.413500,1.041658,0.865560,97.696922
min,0.000000,1.000000,0.000000,0.166700,0.000000,0.000000,1.000000
25%,327.000000,2.000000,0.000000,21.000000,0.000000,0.000000,72.000000
50%,654.000000,3.000000,0.000000,28.000000,0.000000,0.000000,155.000000
75%,981.000000,3.000000,1.000000,39.000000,1.000000,0.000000,256.000000
max,1308.000000,3.000000,1.000000,80.000000,8.000000,9.000000,328.000000

In [322]:
# Find columns with missingdata
mask = titanic_df.isnull()
print(mask)
print()
print(mask.any())
print()
titanic_df.columns[mask.any()]

      Unnamed: 0  pclass  survived   name  gender    age  sibsp  parch  \
0          False   False     False  False   False  False  False  False
1          False   False     False  False   False  False  False  False
2          False   False     False  False   False  False  False  False
3          False   False     False  False   False  False  False  False
4          False   False     False  False   False  False  False  False
...          ...     ...       ...    ...     ...    ...    ...    ...
1304       False   False     False  False   False  False  False  False
1305       False   False     False  False   False   True  False  False
1306       False   False     False  False   False  False  False  False
1307       False   False     False  False   False  False  False  False
1308       False   False     False  False   False  False  False  False

      ticket   fare  cabin  embarked   boat   body  home.dest
0      False  False  False     False  False   True      False
1      False  False  False     False  False   True      False
2      False  False  False     False   True   True      False
3      False  False  False     False   True  False      False
4      False  False  False     False   True   True      False
...      ...    ...    ...       ...    ...    ...        ...
1304   False  False   True     False   True  False       True
1305   False  False   True     False   True   True       True
1306   False  False   True     False   True  False       True
1307   False  False   True     False   True   True       True
1308   False  False   True     False   True   True       True

[1309 rows x 15 columns]

Unnamed: 0    False
pclass        False
survived      False
name          False
gender        False
age            True
sibsp         False
parch         False
ticket        False
fare           True
cabin          True
embarked       True
boat           True
body           True
home.dest      True
dtype: bool

Index(['age', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest'], dtype='object')

In [323]:
# Print shape of dataset
titanic_df.shape

(1309, 15)

In [324]:
# drop columns with more than 25% missing data

print("Original titanic_df info /n", titanic_df.info())
print()
print("Columns with more than 25% missing data \n",titanic_df.columns[mask.sum()/mask.count()  > 0.25])
print()
col_drp = titanic_df.columns[mask.sum()/mask.count()  > 0.25]
titanic_df.drop(col_drp,axis=1,inplace=True)
print()
print("DF after drop \n",titanic_df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 15 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1309 non-null   int64
 1   pclass      1309 non-null   int64
 2   survived    1309 non-null   int64
 3   name        1309 non-null   object
 4   gender      1309 non-null   object
 5   age         1046 non-null   float64
 6   sibsp       1309 non-null   int64
 7   parch       1309 non-null   int64
 8   ticket      1309 non-null   object
 9   fare        1308 non-null   object
 10  cabin       295 non-null    object
 11  embarked    1307 non-null   object
 12  boat        486 non-null    object
 13  body        121 non-null    float64
 14  home.dest   745 non-null    object
dtypes: float64(2), int64(5), object(8)
memory usage: 153.5+ KB
Original titanic_df info /n None

Columns with more than 25% missing data
 Index(['cabin', 'boat', 'body', 'home.dest'], dtype='object')


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1309 non-null   int64
 1   pclass      1309 non-null   int64
 2   survived    1309 non-null   int64
 3   name        1309 non-null   object
 4   gender      1309 non-null   object
 5   age         1046 non-null   float64
 6   sibsp       1309 non-null   int64
 7   parch       1309 non-null   int64
 8   ticket      1309 non-null   object
 9   fare        1308 non-null   object
 10  embarked    1307 non-null   object
dtypes: float64(1), int64(5), object(5)
memory usage: 112.6+ KB
DF after drop
 None

In [325]:
# drop columns having independent values(which do not affect the survival rate).

In [326]:
#  convert price to numeric
# titanic_df['fare'] = titanic_df['fare'].replace({'\$': '', ',': ''}, regex=True).astype(float)
# titanic_df['fare']
titanic_df['fare'] = titanic_df['fare'].str.replace(',','').str.replace('$','').astype('float')
titanic_df['fare']

0       211.34
1       151.55
2       151.55
3       151.55
4       151.55
         ...
1304     14.45
1305     14.45
1306      7.23
1307      7.23
1308      7.88
Name: fare, Length: 1309, dtype: float64

In [327]:
#  find columns still having missing/na values and also count of missing data
mis = titanic_df.isnull()
print(titanic_df.columns[mis.any()])
print(mis.sum())

Index(['age', 'fare', 'embarked'], dtype='object')
Unnamed: 0      0
pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
embarked        2
dtype: int64

In [328]:
# fill na with mean for fare and age column column.
titanic_df.fillna({'age':titanic_df['age'].mean(),'fare':titanic_df['fare'].mean()},inplace=True)
mis = titanic_df.isnull()
print(titanic_df.columns[mis.any()])
print(mis.sum())

Index(['embarked'], dtype='object')
Unnamed: 0    0
pclass        0
survived      0
name          0
gender        0
age           0
sibsp         0
parch         0
ticket        0
fare          0
embarked      2
dtype: int64

In [329]:
# drop na values for embarked column.
print((titanic_df['embarked'].isnull()).any())
titanic_df['embarked'].dropna(inplace=True)
print()
print((titanic_df['embarked'].isnull()).any())

True

False

In [330]:
# dump the dataframe to a csv file 'titanic_filtered.csv'.
titanic_df.to_csv(r'C:\Users\DIVYA\Documents\DataScienceCourse\Python\numpy\dsc_weekend_20200719\Assignments\Divya\WEEK2_ASSIGNMENT\titanic_filtered_divya1.csv', index = False)

In [331]:
#for surviced column replace 0 with D and 1 with A
print(titanic_df['survived'])
titanic_df['survived']=titanic_df['survived'].replace(0,'D').replace(1,'A')
print()
print(titanic_df['survived'])
titanic_df['survived']

0       1
1       1
2       0
3       0
4       0
       ..
1304    0
1305    0
1306    0
1307    0
1308    0
Name: survived, Length: 1309, dtype: int64

0       A
1       A
2       D
3       D
4       D
       ..
1304    D
1305    D
1306    D
1307    D
1308    D
Name: survived, Length: 1309, dtype: object

0       A
1       A
2       D
3       D
4       D
       ..
1304    D
1305    D
1306    D
1307    D
1308    D
Name: survived, Length: 1309, dtype: object

In [332]:
# find the frequency of different values in survived column
titanic_df['survived'].value_counts()

D    809
A    500
Name: survived, dtype: int64

In [333]:
# - group by gender and survived and see the counts in each category
titanic_df.groupby(['gender','survived']).count()

                 Unnamed: 0  pclass  name  age  sibsp  parch  ticket  fare  \
gender survived
female A                339     339   339  339    339    339     339   339
       D                127     127   127  127    127    127     127   127
male   A                161     161   161  161    161    161     161   161
       D                682     682   682  682    682    682     682   682

                 embarked
gender survived
female A              337
       D              127
male   A              161
       D              682

In [334]:
# find different pclass and no of people in each class
titanic_df['pclass'].value_counts()

3    709
1    323
2    277
Name: pclass, dtype: int64

In [335]:
# find top 5 people with highest values of age. Count no of male and females in the top 5
# (titanic_df['age'].sort_values(ascending=False)).head()
a = (titanic_df.sort_values('age',ascending=False)).head()

print("People with hightest age \n",a[['name','age']])
a['gender'].value_counts()

People with hightest age
                                                    name   age
14                 Barkworth, Mr. Algernon Henry Wilson  80.0
61    Cavendish, Mrs. Tyrell William (Julia Florence...  76.0
1235                                Svensson, Mr. Johan  74.0
135                           Goldschmidt, Mr. George B  71.0
9                               Artagaveytia, Mr. Ramon  71.0

male      4
female    1
Name: gender, dtype: int64

In [336]:
# find max age male and female who survived

a = (titanic_df.sort_values('age',ascending=False)).head()
# a
# print('Male with highest age :',(a.where(a['gender']=='male').head(1)['age']).to_string(index=False))
# a.where(a['gender']=='female')

print((a.loc[(a['gender'] == 'male')].head(1))['age'])
print((a.loc[(titanic_df['gender'] == 'female')].head(1))['age'])

14    80.0
Name: age, dtype: float64
61    76.0
Name: age, dtype: float64

In [337]:
# get average age by gender
titanic_df.groupby("gender")['age'].mean()

gender
female    28.886935
male      30.430716
Name: age, dtype: float64

In [342]:
# get average age by people survived vs not-survived
titanic_df.groupby("survived")['age'].mean()

survived
A    29.058812
D    30.389368
Name: age, dtype: float64